{"class_name": "Model", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_25", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["max_pooling2d_25", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "name": "max_pooling2d_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_26", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "name": "max_pooling2d_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_8", "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_9", "inbound_nodes": [[["max_pooling2d_26", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [80, 64]}, "name": "reshape_4", "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [80, 64]}, "name": "reshape_5", "inbound_nodes": [[["flatten_9", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAcAAABDAAAAc04AAAB8AFwCfQF9AnwBagB9A3wBZABkAIUCZABkAIUCZABk\nAIUCdAFqAmYEGQB8AmQAZACFAmQAZACFAnQBagJkAGQAhQJmBBkAFAB9BHwEUwApAU4pA9oFc2hh\ncGXaAm5w2gduZXdheGlzKQXaBHZlY3PaAXjaAXnaAnN62gJvcKkAcgkAAAD6HzxpcHl0aG9uLWlu\ncHV0LTE4LWZhN2EyOTdkMmIyOD7aCW91dGVyX3BybwEAAABzCAAAAAABCAEGATwB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [80, 64, 64], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "split_1", "trainable": true, "dtype": "float32", "node_def": {"name": "split_1", "op": "Split", "input": ["split_1/split_dim", "lambda_2/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "80"}}}, "constants": {"0": 1}}, "name": "tf_op_layer_split_1", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["tf_op_layer_split_1", 0, 0, {}], ["tf_op_layer_split_1", 0, 1, {}], ["tf_op_layer_split_1", 0, 2, {}], ["tf_op_layer_split_1", 0, 3, {}], ["tf_op_layer_split_1", 0, 4, {}], ["tf_op_layer_split_1", 0, 5, {}], ["tf_op_layer_split_1", 0, 6, {}], ["tf_op_layer_split_1", 0, 7, {}], ["tf_op_layer_split_1", 0, 8, {}], ["tf_op_layer_split_1", 0, 9, {}], ["tf_op_layer_split_1", 0, 10, {}], ["tf_op_layer_split_1", 0, 11, {}], ["tf_op_layer_split_1", 0, 12, {}], ["tf_op_layer_split_1", 0, 13, {}], ["tf_op_layer_split_1", 0, 14, {}], ["tf_op_layer_split_1", 0, 15, {}], ["tf_op_layer_split_1", 0, 16, {}], ["tf_op_layer_split_1", 0, 17, {}], ["tf_op_layer_split_1", 0, 18, {}], ["tf_op_layer_split_1", 0, 19, {}], ["tf_op_layer_split_1", 0, 20, {}], ["tf_op_layer_split_1", 0, 21, {}], ["tf_op_layer_split_1", 0, 22, {}], ["tf_op_layer_split_1", 0, 23, {}], ["tf_op_layer_split_1", 0, 24, {}], ["tf_op_layer_split_1", 0, 25, {}], ["tf_op_layer_split_1", 0, 26, {}], ["tf_op_layer_split_1", 0, 27, {}], ["tf_op_layer_split_1", 0, 28, {}], ["tf_op_layer_split_1", 0, 29, {}], ["tf_op_layer_split_1", 0, 30, {}], ["tf_op_layer_split_1", 0, 31, {}], ["tf_op_layer_split_1", 0, 32, {}], ["tf_op_layer_split_1", 0, 33, {}], ["tf_op_layer_split_1", 0, 34, {}], ["tf_op_layer_split_1", 0, 35, {}], ["tf_op_layer_split_1", 0, 36, {}], ["tf_op_layer_split_1", 0, 37, {}], ["tf_op_layer_split_1", 0, 38, {}], ["tf_op_layer_split_1", 0, 39, {}], ["tf_op_layer_split_1", 0, 40, {}], ["tf_op_layer_split_1", 0, 41, {}], ["tf_op_layer_split_1", 0, 42, {}], ["tf_op_layer_split_1", 0, 43, {}], ["tf_op_layer_split_1", 0, 44, {}], ["tf_op_layer_split_1", 0, 45, {}], ["tf_op_layer_split_1", 0, 46, {}], ["tf_op_layer_split_1", 0, 47, {}], ["tf_op_layer_split_1", 0, 48, {}], ["tf_op_layer_split_1", 0, 49, {}], ["tf_op_layer_split_1", 0, 50, {}], ["tf_op_layer_split_1", 0, 51, {}], ["tf_op_layer_split_1", 0, 52, {}], ["tf_op_layer_split_1", 0, 53, {}], ["tf_op_layer_split_1", 0, 54, {}], ["tf_op_layer_split_1", 0, 55, {}], ["tf_op_layer_split_1", 0, 56, {}], ["tf_op_layer_split_1", 0, 57, {}], ["tf_op_layer_split_1", 0, 58, {}], ["tf_op_layer_split_1", 0, 59, {}], ["tf_op_layer_split_1", 0, 60, {}], ["tf_op_layer_split_1", 0, 61, {}], ["tf_op_layer_split_1", 0, 62, {}], ["tf_op_layer_split_1", 0, 63, {}], ["tf_op_layer_split_1", 0, 64, {}], ["tf_op_layer_split_1", 0, 65, {}], ["tf_op_layer_split_1", 0, 66, {}], ["tf_op_layer_split_1", 0, 67, {}], ["tf_op_layer_split_1", 0, 68, {}], ["tf_op_layer_split_1", 0, 69, {}], ["tf_op_layer_split_1", 0, 70, {}], ["tf_op_layer_split_1", 0, 71, {}], ["tf_op_layer_split_1", 0, 72, {}], ["tf_op_layer_split_1", 0, 73, {}], ["tf_op_layer_split_1", 0, 74, {}], ["tf_op_layer_split_1", 0, 75, {}], ["tf_op_layer_split_1", 0, 76, {}], ["tf_op_layer_split_1", 0, 77, {}], ["tf_op_layer_split_1", 0, 78, {}], ["tf_op_layer_split_1", 0, 79, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_10", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "softmax_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "softmax_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["softmax_2", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}